tests/ab-tests/ab-static.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking bazh_chat.ru (be patient)


Server Software:        nginx/1.14.0
Server Hostname:        bazh_chat.ru
Server Port:            80

Document Path:          /
Document Length:        171 bytes

Concurrency Level:      4
Time taken for tests:   1.148 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    9901
Total transferred:      4169505 bytes
HTML transferred:       1710000 bytes
Requests per second:    8712.81 [#/sec] (mean)
Time per request:       0.459 [ms] (mean)
Time per request:       0.115 [ms] (mean, across all concurrent requests)
Transfer rate:          3547.67 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.6      0      12
Waiting:        0    0   0.6      0      12
Total:          0    0   0.6      0      12

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      1
  95%      2
  98%      3
  99%      4
 100%     12 (longest request)